In [2]:
import pandas as pd # pandas 모듈 불러오기
import numpy as np # numpy 모듈 불러오기.. 통계, 수식 등등 수학이 필요 할 때 많이 사용됩니다. pandas와 numpy는 같이 쓰일 때가 많습니다.

In [3]:
s = pd.Series([1,2,3,np.nan,6,7]) # np.nan : NaN (Not a Number) 값으로 설정하기
print(type(s)) # 타입 확인
s # pandas의 series 자료형은 파이썬의 리스트로 이루어진 여러 데이터를 한꺼번에 관리 할 수 있다.

<class 'pandas.core.series.Series'>

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    7.0
dtype: float64

In [4]:
dates = pd.date_range('20180312', periods=5) # 2018/03/12 를 기준으로 5일간 날짜 설정하기
dates

DatetimeIndex(['2018-03-12', '2018-03-13', '2018-03-14', '2018-03-15',
               '2018-03-16'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(5,4), #5행 4열 형태의 난수 발생하기
                  index = dates, # 인덱스 지정(아까 만든 5개의 날짜가 들어있는 dates)
                  columns=['A','B','C','D']) # 컬럼 지정

In [6]:
df.head(3)

                   A         B         C         D
2018-03-12  0.627526  1.008280  0.328997  0.360038
2018-03-13 -0.959135  0.011105 -0.236310 -1.233179
2018-03-14 -0.589022  0.391481 -0.089087 -1.013374

In [7]:
df.describe()

              A         B         C         D
count  5.000000  5.000000  5.000000  5.000000
mean  -0.288025 -0.025151  0.261302 -0.406902
std    0.587548  0.768991  0.522102  0.681981
min   -0.959135 -0.863030 -0.236310 -1.233179
25%   -0.589022 -0.673591 -0.089087 -1.013374
50%   -0.263535  0.011105  0.198163 -0.075197
75%   -0.255959  0.391481  0.328997 -0.072798
max    0.627526  1.008280  1.104748  0.360038

In [8]:
df.sort_values(by='B', ascending=False) # 컬럼 B를 기준으로 데이터 프레임 정렬하기

                   A         B         C         D
2018-03-12  0.627526  1.008280  0.328997  0.360038
2018-03-14 -0.589022  0.391481 -0.089087 -1.013374
2018-03-13 -0.959135  0.011105 -0.236310 -1.233179
2018-03-16 -0.263535 -0.673591  1.104748 -0.072798
2018-03-15 -0.255959 -0.863030  0.198163 -0.075197

In [10]:
df.loc[dates[0]] # dates 변수의 첫 번째 값을 활용해 해당하는 위치의 값 보기

A    0.627526
B    1.008280
C    0.328997
D    0.360038
Name: 2018-03-12 00:00:00, dtype: float64

In [11]:
df.A

2018-03-12    0.627526
2018-03-13   -0.959135
2018-03-14   -0.589022
2018-03-15   -0.255959
2018-03-16   -0.263535
Freq: D, Name: A, dtype: float64

In [12]:
df[df>0]

                   A         B         C         D
2018-03-12  0.627526  1.008280  0.328997  0.360038
2018-03-13       NaN  0.011105       NaN       NaN
2018-03-14       NaN  0.391481       NaN       NaN
2018-03-15       NaN       NaN  0.198163       NaN
2018-03-16       NaN       NaN  1.104748       NaN

In [13]:
df2 = df.copy()
df2['E'] = ['one','one','two','three','four'] 
df2

                   A         B         C         D      E
2018-03-12  0.627526  1.008280  0.328997  0.360038    one
2018-03-13 -0.959135  0.011105 -0.236310 -1.233179    one
2018-03-14 -0.589022  0.391481 -0.089087 -1.013374    two
2018-03-15 -0.255959 -0.863030  0.198163 -0.075197  three
2018-03-16 -0.263535 -0.673591  1.104748 -0.072798   four

In [15]:
df2['E'].isin(['two','four'])

2018-03-12    False
2018-03-13    False
2018-03-14     True
2018-03-15    False
2018-03-16     True
Freq: D, Name: E, dtype: bool

In [17]:
df2[df2['E'].isin(['two','one'])]

                   A         B         C         D    E
2018-03-12  0.627526  1.008280  0.328997  0.360038  one
2018-03-13 -0.959135  0.011105 -0.236310 -1.233179  one
2018-03-14 -0.589022  0.391481 -0.089087 -1.013374  two